---
kind: property
id: P:Autodesk.Revit.DB.OverrideGraphicSettings.SurfaceForegroundPatternId
source: html/cd64973e-4dd9-67a2-fb29-16d6c913f623.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.SurfaceForegroundPatternId Property

The ElementId of the surface foreground fill pattern override.
 A value of InvalidElementId means no override is set.

## Syntax (C#)
```csharp
public ElementId SurfaceForegroundPatternId { get; }
```